#ifndef __LCD_H
#define __LCD_H

#include "Type.h"

#define LCDBACKEN  1
#define LCDBACKOF  0
/**********************************************函数定义***************************************************** 
* 函数名称: void LcdInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: LCD的io初始化  
* 作    者: by lhb_steven
* 日    期: 2016/3/29
************************************************************************************************************/ 
void LcdInit(void);
void LcdSetNum(u8 data1,u8 data2,u8 data3,u8 data4);
void LcdSetPoint(u8 cmd);
/**********************************************函数定义***************************************************** 
* 函数名称: void LcdBcakLedSet(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能: 背光控制  
* 作    者: by lhb_steven
* 日    期: 2016/3/29
************************************************************************************************************/ 
void LcdBcakLedSet(u8 cmd);
#endif

