#ifndef __MOTO_H
#define __MOTO_H

#include "Type.h"

#define MOTOEN  1
#define MOTOOF  0

/**********************************************函数定义***************************************************** 
* 函数名称: void MotoInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: 初始化  
* 作    者: by lhb_steven
* 日    期: 2016/3/29
************************************************************************************************************/ 
void MotoInit(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoSet(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能: 关闭或打开 1：打开 0:关闭  
* 作    者: by lhb_steven
* 日    期: 2016/3/29
************************************************************************************************************/ 
void MotoSet(u8 cmd);

#endif


