/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：Moto.h
*
* 文件标识：lhb
* 摘    要：电机驱动
*
*
* 当前版本：v1.0
* 作    者：lhb Steven
* 完成日期：2016/3/29
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#include "Moto.h"
#define MOTO PA_ODR_ODR1
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: 初始化  
* 作    者: by lhb_steven
* 日    期: 2016/3/29
************************************************************************************************************/ 
void MotoInit(void) { 
    PA_DDR_DDR1 = 1;
    PA_CR1_C11 = 1;
    PA_CR2_C21 = 0;
    MotoSet(MOTOOF);
}
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoSet(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能: 关闭或打开 1：打开 0:关闭  
* 作    者: by lhb_steven
* 日    期: 2016/3/29
************************************************************************************************************/ 
void MotoSet(u8 cmd) { 
    MOTO = cmd;
}


