/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：Music.h
*
* 文件标识：lhb
* 摘    要：蜂鸣器驱动
*
*
* 当前版本：V1.0
* 作    者：lhb Steven
* 完成日期：2016/3/29
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#include "Music.h"
/**********************************************函数定义***************************************************** 
* 函数名称: void MusicInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: 初始化  
* 作    者: by lhb_steven
* 日    期: 2016/3/29
************************************************************************************************************/ 
void MusicInit(void) { 
    PD_DDR_DDR4 = 1;
    PD_CR1_C14 = 1;
    PD_CR2_C24 = 0;
    
    TIM2_IER = 0x00;         /*PWM中断主要在这里进行调整*/
    TIM2_CCMR1 = 0x78;  //pwm模式2

    TIM2_CCER1 = 0x03;
    
    TIM2_PSCR = 0x05;         //8^1 分频为1M 
    TIM2_ARRH = 0x00;
    TIM2_ARRL = 0xFE;        //每500us中断一次1F4-2k,100-10k

    TIM2_CCR1H = 0x00;
    TIM2_CCR1L = 0Xff;        //设置占空比，即计数器到多少后 7f

    TIM2_CR1 = 0x04;
    TIM2_CR1 |= BIT(0);              //计数器使能，开始计数
}
static u16 music_time = 0;
/**********************************************函数定义***************************************************** 
* 函数名称: void MusicGetTime(u8) 
* 输入参数: void 
* 返回参数: u8  
* 功    能: 获取时间  
* 作    者: by lhb_steven
* 日    期: 2016/3/29
************************************************************************************************************/ 
u8 MusicGetTime(void) { 
    return music_time;
}
/**********************************************函数定义***************************************************** 
* 函数名称: void MusicSetTime(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能: 设置值  
* 作    者: by lhb_steven
* 日    期: 2016/3/29
************************************************************************************************************/ 
void MusicSetTime(u8 cmd) { 
    music_time = cmd;
}
/**********************************************函数定义***************************************************** 
* 函数名称: void MusicSet(u16 cmd) 
* 输入参数: u16 cmd 
* 返回参数: void  
* 功    能: 开启蜂鸣器  
* 作    者: by lhb_steven
* 日    期: 2016/3/29
************************************************************************************************************/ 
void MusicSet(u16 cmd) { 
    music_time = cmd;
    TIM2_CCR1L = 0x7c;
}




