
#include "Timer.h"

void TimerInit(void) {
    TIM4_IER = 0x00;//       
    TIM4_EGR = 0x01;// 
    TIM4_PSCR = 0x05;// 计数器时钟=主时钟/128=16MHZ/128
    TIM4_ARR = 0x3f;// 设定重装载时的寄存器值，255是最大值
    //TIM4_CNTR = 0x00;// 设定计数器的初值
    // 定时周期=(ARR+1)*64=16320uS
    TIM4_IER = 0x01;//   
    TIM4_CR1 = 0x01;  
}

static u8 time_flag = 0;

u8 TimerGetTimeFlag(void) {
    return time_flag;
}

void TimerClearTimeFlag(void) {
    time_flag = 0;
}
/***********************************************变量声明*****************************************************
* 功    能: 打开时间标志秒  
* 作    者: by lhb_steven
* 日    期: 2016/4/3
************************************************************************************************************/ 
static u8 time_flash_s = 0;
/***********************************************变量声明*****************************************************
* 功    能: 打开时间标志位  
* 作    者: by lhb_steven
* 日    期: 2016/4/3
************************************************************************************************************/ 
static u8 time_flash_m = 0;
/**********************************************函数定义***************************************************** 
* 函数名称: void TimerSetTimeFlah(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能: 设置打开值  
* 作    者: by lhb_steven
* 日    期: 2016/4/3
************************************************************************************************************/ 
void TimerSetTimeFlah(u8 cmd) { 
    time_flash_m = 0;
}
/**********************************************函数定义***************************************************** 
* 函数名称: u16 TimerGetTimeFlash(void) 
* 输入参数: void 
* 返回参数: u16  
* 功    能: 获取时间值  
* 作    者: by lhb_steven
* 日    期: 2016/4/3
************************************************************************************************************/ 
u16 TimerGetTimeFlash(void) { 
    return time_flash_m;
}
#pragma vector=0x19
__interrupt void TIM4_UPD_OVF_IRQHandler(void)
{
    static u16 count_time = 0;
    TIM4_SR = 0x00;
    
    if(count_time < 5000) {//400 test for 2016/1/19
        count_time++;
    } else {
        //1秒进入一次
        count_time = 0;
        time_flag++;
        if(time_flash_s < 60) {
            time_flash_s++;
        } else {
            //1分钟进入一次
            time_flash_s = 0;
            time_flash_m++;
        }
    }

    return;
}


